In [52]:
import os
from pathlib import Path
import pandas as pd
#Get Current File Path
full_path = os.getcwd()
#Set Project File Path
ProjectPath = str(Path(full_path).parents[0])

df = pd.read_excel(ProjectPath + '\\data\\raw\\Titanic_Test.xlsx', sheet_name='test')
df.head(1)

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q

## Keep, Drop, Rearrange, Rename Columns

In [14]:
#Keep Columns
df1 = df[['PassengerId','Pclass','Name']]
df1.head(1)

   PassengerId  Pclass              Name
0          892       3  Kelly, Mr. James

In [16]:
#Drop 1 column
df1 = df.drop('Name',axis=1)
df1.head(1)

,PassengerId,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,male,34.5,0,0,330911,7.8292,NaN,Q

In [17]:
#Drop Multiple Columns
df1 = df.drop(['PassengerId','Name'],axis=1)
df1.head(1)

   Pclass   Sex   Age  SibSp  Parch  Ticket    Fare Cabin Embarked
0       3  male  34.5      0      0  330911  7.8292   NaN        Q

In [19]:
#Rearrange Columns
df1 = df[['PassengerId','Name','Pclass','Sex','Age','SibSp','Parch','Ticket','Fare','Cabin','Embarked']]
df1.head(1)

,PassengerId,Name,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,"Kelly, Mr. James",3,male,34.5,0,0,330911,7.8292,NaN,Q

In [21]:
#Make a copy
df1 = df.copy(deep=True)
#Rename Columns (order of the columns are important here)
df1.columns = ['PassengerId1','Name1','Pclass1','Sex1','Age1','SibSp1','Parch1','Ticket1','Fare1','Cabin1','Embarked1']
df1.head(1)

,PassengerId1,Name1,Pclass1,Sex1,Age1,SibSp1,Parch1,Ticket1,Fare1,Cabin1,Embarked1
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q

## Filtering and Subsets

In [36]:
#Using .query() for filtering or subset
df1 = df.query('(Sex=="male") & (Age<20)')
print(len(df))
print(len(df1))
df1.head(5)

418
33

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
5,897,3,"Svensson, Mr. Johan Cervin",male,14.0,0,0,7538,9.2250,NaN,S
21,913,3,"Olsen, Master. Artur Karl",male,9.0,0,1,C 17368,3.1708,NaN,S
35,927,3,"Katavelas, Mr. Vassilios (Catavelas Vassilios"")""",male,18.5,0,0,2682,7.2292,NaN,C
55,947,3,"Rice, Master. Albert",male,10.0,4,1,382652,29.1250,NaN,Q
60,952,3,"Dika, Mr. Mirko",male,17.0,0,0,349232,7.8958,NaN,S

In [35]:
#Using .loc for filtering or subset
df1 = df.loc[(df['Sex'] == 'male') & (df['Age']<20)]
print(len(df))
print(len(df1))
df1.head(5)

418
33

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
5,897,3,"Svensson, Mr. Johan Cervin",male,14.0,0,0,7538,9.2250,NaN,S
21,913,3,"Olsen, Master. Artur Karl",male,9.0,0,1,C 17368,3.1708,NaN,S
35,927,3,"Katavelas, Mr. Vassilios (Catavelas Vassilios"")""",male,18.5,0,0,2682,7.2292,NaN,C
55,947,3,"Rice, Master. Albert",male,10.0,4,1,382652,29.1250,NaN,Q
60,952,3,"Dika, Mr. Mirko",male,17.0,0,0,349232,7.8958,NaN,S

## Replace values using np.where

In [8]:
#Make a copy
df1 = df.copy(deep=True)
import numpy as np
#if sex = male, then =M else return original value
df1['Sex'] = np.where(df1['Sex']=="male","M",df1['Sex'])
df1.head(5)

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",M,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",M,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",M,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

## Substring

In [4]:
#Make a copy
df1 = df.copy(deep=True)

#Change Sex column from male to M and female to F using substring.
#Substring is a way to extract a part of a string. In this case we just take the first letter in the column 'Sex'.
#You may also use np.where to achieve the same results.
df1['Sex1'] = df['Sex'].str[:1]

In [5]:
df1[['Sex','Sex1']].head()

      Sex Sex1
0    male    m
1  female    f
2    male    m
3    male    m
4  female    f

## Count # of Rows of dataframe

In [6]:
len(df)

418

In [7]:
#to count how many rows of data where the passanger is male (combining len() and .query()):
len(df.query('Sex=="male"'))

266

## Removing Blankspace

### Removing leading and trailing blanks

In [15]:
#Make a copy
df1 = df.copy(deep=True)

df1['Name1'] = df1['Name'].str.strip()
df1[['Name','Name1']].head(5)

,Name,Name1
0,"Kelly, Mr. James","Kelly, Mr. James"
1,"Wilkes, Mrs. James (Ellen Needs)","Wilkes, Mrs. James (Ellen Needs)"
2,"Myles, Mr. Thomas Francis","Myles, Mr. Thomas Francis"
3,"Wirz, Mr. Albert","Wirz, Mr. Albert"
4,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)","Hirvonen, Mrs. Alexander (Helga E Lindqvist)"

### Remove all space (compress)

In [38]:
#Make a copy
df1 = df.copy(deep=True)

df1['Name1'] = df1['Name'].replace(' ','')
df1[['Name','Name1']].head(5)

,Name,Name1
0,"Kelly, Mr. James","Kelly, Mr. James"
1,"Wilkes, Mrs. James (Ellen Needs)","Wilkes, Mrs. James (Ellen Needs)"
2,"Myles, Mr. Thomas Francis","Myles, Mr. Thomas Francis"
3,"Wirz, Mr. Albert","Wirz, Mr. Albert"
4,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)","Hirvonen, Mrs. Alexander (Helga E Lindqvist)"

### Remove multiple space and only keep 1 space in between each words

In [64]:
#Make a copy
import pandas as pd

# Sample DataFrame
data = {'Column_with_blanks': ['This   is   a   sentence', 'Another     example', '    More   blanks']}
df1 = pd.DataFrame(data)

print('before removing the blanks:')
for i in df1['Column_with_blanks'].tolist():
    print(i)

#add multiple spaces in between Name Column:
df1['Column_with_blanks'] = df1['Column_with_blanks'].str.replace(r'\s+', ' ', regex=True)
print('-------------')
print('')
print('after removing the blanks:')
for i in df1['Column_with_blanks'].tolist():
    print(i)

before removing the blanks:
This   is   a   sentence
Another     example
    More   blanks
-------------

after removing the blanks:
This is a sentence
Another example
 More blanks

## To be continued

In [ ]:
9. capitalized words
10. Merge tables
11. Append tables and concatenate tables
12. Sort tables
13. remove duplicates
14. Converting columns to string/int/datetime
15. Cleanning datetime
16. Converting scientific numbers to strings
17. Transpose dataframe
18. Dealling with Null and nan values